## staging: manifest_secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                  NAME                                  |
|----------|------------------------------------------------------------------------|
| recreate | `aws_secretsmanager_secret_version.manifest_new_relic_api_key_version` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
18:47:36.989 STDOUT terraform: -/+ destroy and then create replacement
18:47:36.989 STDOUT terraform: Terraform will perform the following actions:
18:47:36.989 STDOUT terraform:   # aws_secretsmanager_secret_version.manifest_new_relic_api_key_version must be replaced
18:47:36.989 STDOUT terraform: -/+ resource "aws_secretsmanager_secret_version" "manifest_new_relic_api_key_version" {
18:47:36.989 STDOUT terraform:       ~ arn                  = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_NEW_RELIC_API_KEY-dHdHM8" -> (known after apply)
18:47:36.989 STDOUT terraform:       + has_secret_string_wo = (known after apply)
18:47:36.989 STDOUT terraform:       ~ id                   = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:MANIFEST_NEW_RELIC_API_KEY-dHdHM8|terraform-20250206172040767300000004" -> (known after apply)
18:47:36.989 STDOUT terraform:       ~ secret_string        = (sensitive value) # forces replacement
18:47:36.989 STDOUT terraform:       ~ version_id           = "terraform-20250206172040767300000004" -> (known after apply)
18:47:36.989 STDOUT terraform:       ~ version_stages       = [
18:47:36.989 STDOUT terraform:           - "AWSCURRENT",
18:47:36.989 STDOUT terraform:         ] -> (known after apply)
18:47:36.989 STDOUT terraform:         # (4 unchanged attributes hidden)
18:47:36.989 STDOUT terraform:     }
18:47:36.989 STDOUT terraform: Plan: 1 to add, 0 to change, 1 to destroy.
18:47:36.989 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
18:47:36.990 STDOUT terraform: Saved the plan to: plan.tfplan
18:47:36.990 STDOUT terraform: To perform exactly these actions, run the following command to apply:
18:47:36.990 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_admin_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_auth_tokens"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_default_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_pool_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_pinpoint_sc_template_ids"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_route53_zone"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_aws_ses_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cache_clear_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cache_ops_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_crm_github_personal_access_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cypress_auth_client_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_cypress_user_pw_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_dangerous_salt"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_debug_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_docker_hub_pat"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_docker_hub_username"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.manifest_document_download_api_key"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
